[
  {
    "id": 1,
    "title": "Personal Portfolio - Single Page Application",
    "shortDescription": "Modern and responsive portfolio site built with Angular 20, showcasing full-stack skills and design capabilities",
    "projectTags": ["Angular 20", "TypeScript", "SCSS", "RxJS", "Responsive Design", "SPA"],
    "category": "Web Development",
    "role": "Full-Stack Developer & Designer",
    "duration": "2 months",
    "year": 2024,
    "teamSize": "Individual project",
    "liveUrl": "https://samexperience.github.io/Portfolio",
    "githubUrl": "https://github.com/SamExperience/Portfolio",

    "personalData": {
      "name": "Samuele Deriu",
      "role": "IT Developer",
      "urlImg": "assets/images/profile/SamueleDeriu.webp"
    },

    "description": "This project represents the creation of my personal portfolio as a Single Page Application built with Angular 20. The goal was to create a modern, high-performance, visually polished site that reflects my technical and design skills, going beyond pre-made templates. I wanted a smooth experience with responsive animations and a modular structure based on standalone components. The interface combines lightness, accessibility, and visual identity, ensuring high performance even on mobile devices. During development, I focused on every detail: from content planning to layout design, to optimizing resource and code loading. The result is a portfolio that not only showcases my projects but also serves as an example of good front-end design and development.",

    "problemStatement": "Many developer portfolios look very similar, are not performant, or are not optimized for mobile. I wanted a solution that combined professionalism, flexibility, and coherent design, without relying on static templates or limited visual tools. This project was created to address this exact problem: building a custom, easily extensible, technically solid portfolio that highlights real Angular development skills and attention to UX.",

    "developmentProcess": [
      {
        "phase": "Research and Planning",
        "description": "Analysis of other developers' portfolios to identify strengths and areas for improvement. Definition of content structure and communication priorities.",
        "duration": "about 2–3 days"
      },
      {
        "phase": "Design and Visual Setup",
        "description": "Creation of the layout and visual style, balancing text and spacing. Iterative work improving the look during development, implementing light/dark theme support, consistent colors, and typography.",
        "duration": "iterative"
      },
      {
        "phase": "Component Development",
        "description": "Development of Angular standalone components and routing setup. Animations implemented with CSS keyframes. Distributed and interactive work throughout development.",
        "duration": "iterative"
      },
      {
        "phase": "Content and Performance Optimization",
        "description": "Image compression in WebP format, dependency management, chunk optimization, and content review to ensure high performance and fast loading times.",
        "duration": "about 2 days"
      },
      {
        "phase": "Testing and Deployment",
        "description": "Testing across multiple browsers and devices to ensure responsiveness and accessibility. Real-time checks during mobile-first development and final deployment on GitHub Pages with a custom domain.",
        "duration": "about 1 day"
      }
    ],

    "features": [
      {
        "icon": "⚡",
        "title": "Optimized Performance",
        "description": "Lazy loading, code splitting, and optimized assets achieving 95+ on Lighthouse with loading times under one second. Route-based code splitting reduces the initial bundle to 30KB."
      },
      {
        "icon": "🎨",
        "title": "Modern UI/UX",
        "description": "Custom interface with smooth animations, glassmorphism effects, and intuitive navigation patterns. Micro-interactions at 60fps using CSS transformations."
      },
      {
        "icon": "📱",
        "title": "Fully Responsive",
        "description": "Mobile-first approach with layouts optimized for smartphones (320px+), tablets, and desktops up to 4K. Breakpoints tested on over 15 devices."
      },
      {
        "icon": "🔧",
        "title": "Modular Architecture",
        "description": "Component-based structure with Angular standalone components for maintainability and scalability. Clear separation between services, models, and presentation."
      },
      {
        "icon": "🎯",
        "title": "Dynamic Content",
        "description": "JSON-based showcase with dynamic routing and smooth page transitions. Content updates only require JSON modifications."
      },
      {
        "icon": "♿",
        "title": "Accessibility First",
        "description": "WCAG 2.1 AA compliance with semantic HTML5, proper ARIA labels, keyboard navigation support, and testing with NVDA and VoiceOver."
      }
    ],

    "accessibility": [
      "Verifiable WCAG 2.1 AA compliance (automatic reports available)",
      "Full keyboard navigation with clearly visible focus indicators",
      "Semantic structure and ARIA landmarks optimized for screen readers",
      "Descriptive alt text on all images and accessible gallery"
    ],

    "futureImprovements": [
      "Develop a fixed mobile navigation menu on the main page",
      "Enable fullscreen view for gallery images"
    ],

    "heroImage": "assets/images/projects/portfolio/hero-img.webp",
    "imgURL": [
      {
        "url": "assets/images/projects/portfolio/card-img.webp",
        "title": "Hero section of the portfolio homepage",
        "altText": "Portfolio homepage with animated profile section, gradient background, project cards, and responsive navigation menu"
      }
    ],

    "metrics": [
      { "value": "95+", "label": "Lighthouse Score" },
      { "value": "0.9s", "label": "Initial Load Time" },
      { "value": "309KB", "label": "Bundle Size" }
    ]
  }
]
