[
  {
    "id": 1,
    "title": "Portfolio personnel - Single Page Application",
    "shortDescription": "Site portfolio moderne et responsive construit avec Angular 20, montrant des compétences full-stack et des capacités de design",
    "projectTags": ["Angular 20", "TypeScript", "SCSS", "RxJS", "Responsive Design", "SPA"],
    "category": "Développement Web",
    "role": "Développeur Full-Stack & Designer",
    "duration": "2 mois",
    "year": 2024,
    "teamSize": "Projet individuel",
    "liveUrl": "https://samexperience.github.io/Portfolio",
    "githubUrl": "https://github.com/SamExperience/Portfolio",

    "personalData": {
      "name": "Samuele Deriu",
      "role": "Développeur IT",
      "urlImg": "assets/images/profile/SamueleDeriu.webp"
    },

    "description": "Ce projet représente la réalisation de mon portfolio personnel en tant que Single Page Application construite avec Angular 20. L'objectif était de créer un site moderne, performant et visuellement soigné qui reflète mes compétences techniques et de design, allant au-delà des templates préfabriqués. J'ai voulu une expérience fluide, avec des animations réactives et une structure modulaire basée sur des composants standalone. L'interface combine légèreté, accessibilité et identité visuelle, garantissant de hautes performances même sur mobile. Pendant le développement, j'ai pris soin de chaque détail : de la planification du contenu à la conception du layout, jusqu'à l'optimisation du chargement des ressources et du code. Le résultat est un portfolio qui non seulement présente mes projets, mais constitue lui-même un exemple de bon design et développement front-end.",

    "problemStatement": "Beaucoup de portfolios de développeurs se ressemblent trop, sont peu performants ou non optimisés pour les mobiles. Je cherchais une solution alliant professionnalisme, flexibilité et design cohérent, sans dépendre de templates statiques ou d'outils limités. Ce projet vise précisément à résoudre ce problème : construire un portfolio personnalisé, extensible et techniquement solide, qui mette en valeur de réelles compétences Angular et une attention particulière à l'UX.",

    "developmentProcess": [
      {
        "phase": "Recherche et planification",
        "description": "Analyse des portfolios d'autres développeurs pour identifier points forts et axes d'amélioration. Définition de la structure des contenus et des priorités de communication.",
        "duration": "environ 2–3 jours"
      },
      {
        "phase": "Design et mise en page",
        "description": "Création du layout et du style visuel, en équilibrant texte et espaces. Travail itératif améliorant l'apparence pendant le développement, avec support thème clair/sombre, couleurs et typographie cohérentes.",
        "duration": "itératif"
      },
      {
        "phase": "Développement des composants",
        "description": "Réalisation des composants Angular standalone et définition du routing. Animations réalisées avec keyframes CSS. Travail distribué et interactif tout au long du développement.",
        "duration": "itératif"
      },
      {
        "phase": "Optimisation du contenu et performance",
        "description": "Compression des images au format WebP, gestion des dépendances, optimisation des chunks et révision des contenus pour garantir des performances élevées et des temps de chargement rapides.",
        "duration": "environ 2 jours"
      },
      {
        "phase": "Tests et déploiement",
        "description": "Vérification sur différents navigateurs et dispositifs pour garantir responsivité et accessibilité. Contrôles en temps réel pendant le développement mobile-first et publication finale sur GitHub Pages avec domaine personnalisé.",
        "duration": "environ 1 jour"
      }
    ],

    "features": [
      {
        "icon": "⚡",
        "title": "Performances optimisées",
        "description": "Lazy loading, code splitting et assets optimisés atteignant 95+ sur Lighthouse avec un temps de chargement inférieur à une seconde. Le code splitting par route réduit le bundle initial à 30KB."
      },
      {
        "icon": "🎨",
        "title": "UI/UX moderne",
        "description": "Interface personnalisée avec animations fluides, effets glassmorphism et patterns de navigation intuitifs. Micro-interactions à 60fps utilisant des transformations CSS."
      },
      {
        "icon": "📱",
        "title": "Totalement responsive",
        "description": "Approche mobile-first avec layouts optimisés pour smartphone (320px+), tablette et desktop jusqu'à 4K. Points de rupture testés sur plus de 15 appareils."
      },
      {
        "icon": "🔧",
        "title": "Architecture modulaire",
        "description": "Structure basée sur des composants standalone Angular pour maintenabilité et scalabilité. Séparation claire entre services, modèles et présentation."
      },
      {
        "icon": "🎯",
        "title": "Contenus dynamiques",
        "description": "Showcase basé sur JSON avec routing dynamique et transitions fluides entre les pages. Les mises à jour de contenu nécessitent uniquement des modifications du JSON."
      },
      {
        "icon": "♿",
        "title": "Accessibilité prioritaire",
        "description": "Conformité WCAG 2.1 AA avec HTML5 sémantique, étiquettes ARIA appropriées, support de navigation au clavier et tests avec NVDA et VoiceOver."
      }
    ],

    "accessibility": [
      "Conformité vérifiable à WCAG 2.1 AA (rapports automatiques disponibles)",
      "Navigation complète au clavier avec indicateurs de focus clairement visibles",
      "Structure sémantique et landmarks ARIA optimisés pour les lecteurs d'écran",
      "Texte alternatif descriptif sur toutes les images et galerie accessible"
    ],

    "futureImprovements": [
      "Développer un menu de navigation fixe pour mobile sur la page principale",
      "Possibilité d'afficher les images de la galerie en plein écran"
    ],

    "heroImage": "assets/images/projects/portfolio/hero-img.webp",
    "imgURL": [
      {
        "url": "assets/images/projects/portfolio/card-img.webp",
        "title": "Section hero de la page d'accueil du portfolio",
        "altText": "Page d'accueil du portfolio avec section profil animée, fond en gradient, cartes projets et menu de navigation responsive"
      }
    ],

    "metrics": [
      { "value": "95+", "label": "Score Lighthouse" },
      { "value": "0.9s", "label": "Temps de chargement initial" },
      { "value": "309KB", "label": "Taille du bundle" }
    ]
  }
]
